Repository: CommanderXA/sonus
Catalog: lib/l10n/app_*.arb
Languages: de, es, fr, ru

source: Hello
de: Hallo
ru: Привет

# continue_forward
source: Continue
de: Fortsetzen
ru: Далее

# short_description
source: Speech recognition & synthesis tool
de: Spracherkennungs- und -synthesetool
ru: Инструмент распознавания и синтеза речи

source: Add phrase
de: Phrase hinzufügen
es: Agregar frase
fr: Ajouter une phrase
ru: Добавить фразу

source: Add records group
de: Datensatzgruppe hinzufügen
es: Agregar grupo de registros
fr: Ajouter un groupe d'enregistrements
ru: Добавить группу записей

source: Archive of records
de: Archiv der Aufzeichnungen
es: Archivo de registros
fr: Archive des enregistrements
ru: Архив записей

# editing_phrases
source: Quick phrases
de: Schnelle Sätze
es: Frases rápidas
fr: Phrases rapides
ru: Быстрые фразы

source: Edit phrase
de: Satz bearbeiten
es: Editar frase
fr: Modifier la phrase
ru: Изменить фразу

source: Edit records group
de: Datensatzgruppe bearbeiten
es: Editar grupo de registros
fr: Modifier le groupe d'enregistrements
ru: Изменить группу записей

source: Enter text
de: Text eingeben
es: Ingresar texto
fr: Entrez du texte
ru: Введите текст

source: Language
de: Sprache
es: Idioma
ru: Язык

source: Modules
de: Module
es: Módulos
ru: Модули

# language_choosen
source: English
de: Deutsche
es: Español
fr: Français
ru: Русский

# no_phrases
source: No quick prases
de: Keine schnellen Prasen
es: Sin frases rápidas
fr: Pas de prases rapides
ru: Нет быстрых фраз

source: No records saved
de: Keine Aufzeichnungen gespeichert
es: No se guardaron registros
fr: Aucun enregistrement enregistré
ru: Нет сохраненных записей

source: No records
de: Keine Aufzeichnungen
es: Sin registros
fr: Aucun enregistrement
ru: Нет записей

source: Settings
de: Die Einstellungen
es: Configuración
fr: Paramètres
ru: Настройки

source: Speech recognition
de: Spracherkennung
es: Reconocimiento de voz
fr: Reconnaissance vocale
ru: Распознавание речи

source: Text to speech
de: Text zu Sprache
es: Texto a voz
ru: Текст в речь

# system_language
source: System
es: Sistema
fr: Système
ru: Системный

source: Dark theme
de: Dunkles Thema
es: Tema oscuro
fr: Thème sombre
ru: Темная тема

# settings_general
source: General
de: Allgemeines
fr: Général
ru: Общие

source: Quick TTS
de: Schnelles TTS,
fr: TTS rapide
ru: Быстрая озвучка

source: Notes
de: Anmerkungen
es: Notas
ru: Заметки

source: Note Groups
de: Hinweis Gruppen
es: Grupos de notas
fr: Groupes de notes
ru: Группы заметок

source: Record Name
de: Datensatzname
es: Nombre de registro
fr: Nom de l'enregistrement
ru: Название записи

# record_save
source: Save
de: Speichern
es: Guardar
fr: Enregistrer
ru: Сохранить

source: Close
de: Schließen
es: Cerca
fr: Fermer
ru: Закрыть

source: Choose group
de: Gruppe auswählen
es: Elegir grupo
fr: Choisissez un groupe
ru: Выберите группу

source: Record added
de: Datensatzgruppe hinzugefügt
es: Registro agregado
fr: Enregistrement ajouté
ru: Запись сохранена

source: Record edited
de: Datensatz bearbeitet
es: Registro editado
fr: Enregistrement édité
ru: Запись изменена

source: Record deleted
de: Datensatz gelöscht
es: Registro eliminado
fr: Enregistrement supprimé
ru: Запись удалена

source: Quick phrase added
de: Schnelle Phrase hinzugefügt
es: Frase rápida agregado
fr: Expression rapide ajoutée
ru: Быстрая фраза добавлена

source: Quick phrase edited
de: Schnelle Phrase bearbeitet
es: Frase rápida editada
fr: Expression rapide modifiée
ru: Быстрая фраза изменена

source: Quick phrase deleted
de: Schnelle Phrase gelöscht
es: Frase rápida eliminada
fr: Expression rapide supprimée
ru: Быстрая фраза удалена

# record_group_added
source: Records group added
de: Datensatzgruppe hinzugefügt
es: Grupo de registros agregado
fr: Groupe d'enregistrements ajouté
ru: Группа записей добавлена

# record_group_edited
source: Records group edited
de: Datensatzgruppe bearbeitet
es: Grupo de registros editado
fr: Groupe d'enregistrements modifié
ru: Группа записей изменена

# record_group_deleted
source: Records group deleted
de: Datensatzgruppe gelöscht
es: Grupo de registros eliminado
fr: Groupe d'enregistrements supprimé
ru: Группа записей удалена

source: Phrase copied
de: Phrase kopiert
es: Frase copiada
fr: Phrase copiée
ru: Фраза скопирована

source: No internet connection
de: Keine Internetverbindung
es: Sin conexión a Internet
fr: Pas de connexion Internet
ru: Нет соединения

# no_mic_permission
source: Speech Recognition requires Microphone use
de: Spracherkennung erfordert die Verwendung eines Mikrofons
es: El reconocimiento de voz requiere el uso de micrófono
fr: La reconnaissance vocale nécessite l'utilisation d'un microphone
ru: Распознавание речи требует использование микрофона

# grant_mic_permission
source: Tap on icon to grant permission
de: Tippen Sie auf das Symbol, um die Erlaubnis zu erteilen
es: Toque el ícono para otorgar permiso
fr: Appuyez sur l'icône pour accorder l'autorisation
ru: Нажмите на иконку чтобы дать разрешение

source: Help
de: Hilfe
es: Ayudar
ru: Помощь

# help_stt_not_work
source: Speech Recognition doesn't work
de: Spracherkennung funktioniert nicht
es: El reconocimiento de voz no funciona
ru: Распознавание речи не работает

# help_stt_not_work_solution
source: Speech Recognition uses Google services to recognize your speech. If it doesn't work - find the Google app in the settings and give a microphone permission to it.
de: Die Spracherkennung verwendet Google-Dienste, um Ihre Sprache zu erkennen. Wenn es nicht funktioniert, suchen Sie die Google App in den Einstellungen und erteilen Sie ihr eine Mikrofonberechtigung.
es: El reconocimiento de voz utiliza los servicios de Google para reconocer su voz. Si no funciona, busca la aplicación de Google en la configuración y dale permiso al micrófono.
ru: Распознавание речи использует сервисы Google для преобразования речи в текст. Если оно не работает - найдите приложение Google в настройках и разрешите ему доступ к микрофону.

# help_tts_not_work
source: Text-To-Speech doesn't work
de: Text-to-Speech funktioniert nicht
es: Texto a voz no funciona
ru: Преобразование текста в речь не работает

# help_tts_not_work_solution
source: Speech to text uses Google Speech-to-text plugin for speech synthesis. It may not work if you haven't installed this plugin. Go to Google Play and search for Google Text-to-speech, then install it and reboot SONUS (close and open again).
de: Speech-to-Text verwendet das Google Speech-to-Text-Plug-in für die Sprachsynthese. Es funktioniert möglicherweise nicht, wenn Sie dieses Plugin nicht installiert haben. Gehen Sie zu Google Play und suchen Sie nach Google Text-to-Speech, installieren Sie es und starten Sie SONUS neu (schließen und erneut öffnen).
es: Speech to text utiliza el complemento Google Speech-to-text para la síntesis de voz. Es posible que no funcione si no ha instalado este complemento. Vaya a Google Play y busque Google Text-to-Speech, luego instálelo y reinicie SONUS (cierre y abra de nuevo).
ru: Речь в текст использует плагин Google Speech-to-text для синтеза речи. Оно может не работать, если вы не установили этот плагин. Зайдите в Google Play и найдите Google Text-to-Speech, затем установите его и перезагрузите SONUS (закройте и снова откройте).

source: English
fr: Anglais
